Revit 2027 API
ParameterTypeId.RebarElemEndtreatmentEnd Property
 "End Treatment At End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarElemEndtreatmentEnd { get; }
Public Shared ReadOnly Property RebarElemEndtreatmentEnd As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarElemEndtreatmentEnd {
	ForgeTypeId^ get ();
}
static member RebarElemEndtreatmentEnd : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace